# IsRectangular Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveLoop..::..IsRectangular Method
CurveLoop Class See Also
---
Identifies if the curve loop is rectangular with respect to a given projection plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsRectangular(
	Plane plane
)
```

Visual Basic
---
```text
Public Function IsRectangular ( _
	plane As Plane _
) As Boolean
```

Visual C++
---
```text
public:
bool IsRectangular(
	Plane^ plane
)
```

# ### Parameters
plane
    Type: Autodesk.Revit.DB..::..Plane The plane to which the curves will be projected to determine if they represent a rectangle.
# ### Return Value
True if the curve loop is rectangular, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
CurveLoop Class
Autodesk.Revit.DB Namespace